In [3]:
import pandas as pd

In [4]:
#Task 0 open data/titanic.csv
df = pd.read_csv("data/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#Task 1 how many passangers are in the data?
df.PassengerId.nunique()

In [ ]:
#Task 2 How many distinct Surnames can you see in the data?
splitted_names = df["Name"].str.split(",")
surnames_only = splitted_names.str[0]
surnames_only.nunique()

In [ ]:
#Task 3 sum Fare per A) location of Embarked B) Locatio of Embarked and Sex 
#result should be dataframe

#this result is series
gr = df.groupby("Embarked").Fare.sum()
print(gr, "\n", type(gr))
print("-"*50)
print("-"*50)

#This is df
gr = df.groupby("Embarked", as_index=False).Fare.sum()
print(gr, "\n", type(gr))
print("-"*50)
print("-"*50)


#This is also df
gr = df.groupby("Embarked").Fare.sum()
gr = gr.to_frame()
print(gr, "\n", type(gr))
print("-"*50)
print("-"*50)

In [ ]:
#This is df, Embarked and sex are now multiindeces
gr = df.groupby(["Embarked", "Sex"]).Fare.sum()
print(gr, "\n", type(gr))
print("-"*50)
print("-"*50)


#This is also without Embarked and sex beeing multiindeces
gr = df.groupby(["Embarked", "Sex"], as_index=False).Fare.sum()
print(gr, "\n", type(gr))
print("-"*50)
print("-"*50)

In [ ]:
#Task 4 How wold you drop all rows that contain none? How about dropping tows that have none in Cabin?
no_nan = df.dropna()
no_nan_cabin = df.dropna(subset= "Cabin")

In [ ]:
no_nan_cabin

In [ ]:
#Task 5 Use columns SibSp and Parch to form binary attribute has_family (use max or addition of two columns)

df["has_family"] = df.SibSp + df.Parch
df.loc[df["has_family"] >1, "has_family"] = 1

In [ ]:
# Task 6 drop column has family 
df = df.drop("has_family", axis = 1)

In [ ]:
#Task 7 Use conditions approach to form has_family attriubte
df["has_family"] = ((df.SibSp > 0) | (df.Parch > 0))
df

In [ ]:
#Task 8 What is the overall age average? What is the age average for women? And for men?
print(df.Age.mean())

df.groupby("Sex").Age.mean()

In [ ]:
#Task 9 how many passerngers traveled on their own (alone)?
df.has_family.count() - df.has_family.sum()

In [ ]:
#Task 10 is there any effect of class passengers traveled in and survival rate?
_ = df_filled.groupby('Pclass')['Survived'].agg(Sum='sum', Count='count')
_["Survival ratio"] = _["Sum"]/_["Count"]
_

In [ ]:
#Task 11 Do missing cabin values have something incommon with Pclass?


#Cabin contains NAN values
#So if we do this 
print(df.groupby("Pclass")["Cabin"].agg(Nunique='nunique', Count='count'))
print("Counts do not sum up to len(df) because NAN is not counted!")

df_filled = df.copy()
df_filled["Cabin"] = df_filled["Cabin"].fillna("unknown")
df_filled.groupby("Pclass")["Cabin"].agg(Nunique='nunique', Count='count')

In [ ]:
#Task 12 Create new column family name, count members of the family in data

#we reuse the code snippet from above
df["family_name"] = df["Name"].str.split(",").str[0]
df["family_name_freq"] = df['family_name'].map(df['family_name'].value_counts())

#We wont be able to clean family name frequency for all the names that are repeated
#without its owners being in fact related
#but we can help ourselves out with has_family attribute
df["family_size"] = df["family_name_freq"].values
df.loc[((df.has_family == False)&(df.family_name_freq > 1)), "family_size"] = 1

In [8]:
#Task 13 group Fare by 3 thresholds so you have category cheap fare, regular fare, expensive fare
print(df.Fare.min())
print(df.Fare.max())
print(df.Fare.median())
print(df.Fare.mean())


def findFareGroup(fare):
    if fare<df.Fare.median():
        return "cheap"
    elif fare>=df.Fare.median() and fare<df.Fare.mean():
        return "regular"
    else:
        return "expensive"

0.0
512.3292
14.4542
32.204207968574636

In [9]:
df['FareGroup']=df['Fare'].apply(lambda x: findFareGroup(x))

In [13]:
#Task 14 form an empty dataset, append counts in fare category to it

empty_df = pd.DataFrame([])
grouped_df = df.groupby("FareGroup",as_index = False).PassengerId.nunique()
append_df = pd.concat([empty_df,grouped_df ])
append_df

   FareGroup  PassengerId
0      cheap          440
1  expensive          211
2    regular          240

In [14]:
#Task 15 rename column PassengerId in appended dataframe to Passenger Count
append_df.columns = ["FareGroup", "Passenger Count"]
append_df

   FareGroup  Passenger Count
0      cheap              440
1  expensive              211
2    regular              240